
insert into examination(id, question, answer, exam) values(RANDOM_UUID(), 'Что такое ООП?', 'методология программирования, основанная на представлении программы в виде совокупности объектов,', 'java'),
(RANDOM_UUID(), 'Что такое «инкапсуляция','Инкапсуляция – это свойство системы, позволяющее объединить данные и методы, работающие с ними, в классе и скрыть детали реализации от пользователя', 'java'),
(RANDOM_UUID(), 'Что представляет собой «обмен сообщениями»','Объекты взаимодействуют, посылая и получая сообщения', 'java'),
(RANDOM_UUID(), 'Что такое «полиморфизм»','это свойство системы использовать объекты с одинаковым интерфейсом без информации о типе и внутренней структуре объекта', 'java'),
(RANDOM_UUID(), 'Что такое «абстракция»','Абстрагирование – это способ выделить набор общих характеристик объекта, исключая из рассмотрения частные и незначимые', 'java');

